Results/Verifications/S2427/bottleneck-determination/update_index/threads-28/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=28 oltp_update_index --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 28
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 28 tps: 5111.92 qps: 5111.92 (r/w/o: 0.00/4984.28/127.64) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 28 tps: 4606.82 qps: 4606.82 (r/w/o: 0.00/4494.22/112.60) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 28 tps: 4956.81 qps: 4956.81 (r/w/o: 0.00/4827.91/128.90) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 28 tps: 4569.96 qps: 4569.96 (r/w/o: 0.00/4459.36/110.60) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 28 tps: 4865.64 qps: 4865.64 (r/w/o: 0.00/4747.24/118.40) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 28 tps: 5176.01 qps: 5176.01 (r/w/o: 0.00/5052.41/123.60) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 28 tps: 5328.56 qps: 5328.56 (r/w/o: 0.00/5195.16/133.40) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 28 tps: 5539.60 qps: 5539.60 (r/w/o: 0.00/5406.20/133.40) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 28 tps: 5363.44 qps: 5363.44 (r/w/o: 0.00/5235.34/128.10) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 28 tps: 5311.52 qps: 5311.52 (r/w/o: 0.00/5176.83/134.69) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           495843
        other:                           12515
        total:                           508358
    transactions:                        508358 (5082.86 per sec.)
    queries:                             508358 (5082.86 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0096s
    total number of events:              508358

Latency (ms):
         min:                                    1.13
         avg:                                    5.51
         max:                                  195.02
         95th percentile:                        8.90
         sum:                              2799310.06

Threads fairness:
    events (avg/stddev):           18155.6429/40.51
    execution time (avg/stddev):   99.9754/0.00


real    1m40.144s
user    0m8.332s
sys     0m19.746s